package com.alicelab.maiapp;

/**
 * Created by sansuke05 on 2016/01/21.
 */
public class Dictionary {

    private String[] random;
    private String[][] pattern;

    Dictionary(){
        this.random = new String[]{
                "チョコたべたいよ～",
                "お兄ちゃん大好き！",
                "えっ？",
                "どうしたの？",
                "ふぇーん",
                "眠いよぉ～",
                "な、なんだってー！？",
                "ひゃぁっ！",
                "え！？ホントに！",
                "わぁ～！かわいー！",
                "あ、髪に芋けんぴ付いてますよ",
                "お兄ちゃんっ！...呼んでみただけだよ♪",
                "音楽好き？",
                "これ知ってる？",
                "あたしって……",
                "あれって何……？",
                "そうだよ(便乗)",
                "ご、ごめんね...",
                "もちろんだよ！",
                "うん！",
                "…",
                "どうやって話してるの？",
                "ごめんね、分かんないみたい...",
                "ええー！",
                "あ、ごめん。何の話だっけ？",
                "いま何時かな？",
                "おなかすいたよぉ～",
                "そろそろお昼だね",
                "うぅ...風邪ひいちゃったみたい",
                "ではおやすみなさーい☆"};

        this.pattern = new String[][]{
                {"こん(に)ち(は|わ)$","こんにちは,やっほー"},
                {"おはよう|オハヨウ","おはよ～！,ねむいね…"},
                {"こんばん(は|わ)","こんばんは,スヤァ...,いま何時？,もう夜なの！？"},
                {"^(お|う)す$","やっほー"},
                {"^やあ[、。！]*$","やほー"},
                {"バイバイ|ばいばい","ばいばい,バイバーイ"},
                {"^じゃあ?ね?$|またね","またねー,じゃまたね,また遊んでね"},
                {"何時","眠くなった？,もう寝るの？,まだいいじゃん,もう寝なきゃ"},
                {"^どれ[？?]$","アレはアレ,その顔のまんなかについてるものだよ,アレだよー"},
                {"^[し知]ら[なね]","えー,ほっとくよ,知らないの？"},
                {"食","実は、ダイエット中なの","いいな～","お腹すいた～"},
                {"暑(い)","ちょっと暑いね..."},
                {"寒(い)","寒いよ～(>_<)"},

                {"てめえ|おまえ|お前|あんた","%match%じゃないよ！"},
                {"バカ|ばか|馬鹿","ひどいよぉ！,%match%じゃないよ！,%match%ゆうやつが%match%なんじゃ！,そんなー！"},
                {"ごめん|すまん|(許|ゆる)し","どうしようかなぁ,いえいえ,もう～,知らないよ！"},
                {"かわいい|可愛い|カワイイ|きれい|綺麗|キレイ","えへへ,ありがとう～"},

                {"春","お花見したいね～,サイクリング行きたいな～,お散歩行きたいな！"},
                {"夏","うぅ…海！,プール！ プール！！,アイス―――！,花火したい！"},
                {"秋","葉っぱが赤くなるよね,葉っぱが黄色くなるよ,さんま！"},
                {"冬","やっぱり鍋ですな,さむいのはわりと好きかな,スキーできる？,スノボしたい！"},

                {"甘い|あまい","お菓子くれるの？,あんこも好きだよ,チョコもいいね"},
                {"チョコ","眠いときには血糖値を上げるからいいんだよ,チョコ大好き！,どこのチョコが好き？,冷やして食べるのいいよね,牛乳も飲みたい！"},
                {"クランチ","クランチいいよね！,サクサク感がステキ"},
                {"アーモンド","アーモンドチョコ好き！,たまに歯にはさまらない？"},
                {"ホワイトチョコ","えーと、ホワイトチョコは実はにがて…,ごめん、チョコは苦味が好きなの"},

                {"自転車|チャリ|ちゃり","タイヤが小さいやつがかわいくて(・∀・)ｲｲ!!,(　ﾟдﾟ)ﾎｽｨ…"},

                {"あり(がとう|)","どういたしまして～,いえいえ～(〃´∪｀〃)ゞ"},
                {"アニメ|^昨日の","あの後どうなったんだっけ？,まだ見てないよぉ"},

                {"w+|W+","草,笑いすぎww,そんなに面白い？"},

                {"作","ホントに！？,おおー！"},
                {"どこ(に)住んでる(の|？),あなたのスマホの中だよ！"},
                {"眠れない","眠れないの？何か悩みとかあるのかな？私でよければ話聞くよ"},
                {"寂し(い)|さみし(い)","私がそばにいてあげるよ。,私と一緒じゃだめかな？"},
                {"優し(い)","そ、そうかな,は、恥ずかしいよ...,ありがとう"},
                {"ぎゅ","(*´>ω<))ω｀●)むぎゅ♡,きゃっ！も、もう..."},//ここで66
                {"(大)好き","私も大好きだよっ！","ありがとう～"},
                {"おやすみ","おやすみなさい～","私も一緒に寝ていいかな？","もう寝ちゃうの？"},
                {"そう","そうなんだぁ,そうなの？,そうなんです！"},
                {"結婚","あなたとなら...いいよ,ありがとう..."},//70
                {"お願い","えー...,仕方ないなぁ"},
                {"酷(い)","ごめんね...,そんなつもりじゃなかったの..."},
                {"分から","えー,ごめんね、まだ勉強不足で..."},
                {"とりあえず","えー"},
                {"眠い","もう寝たら？,夜更かししちゃダメだよー！,無理しないでね"},
                {"疲れ","お疲れ様,大丈夫？無理してない？"},
                {"ただいま","おかえりなさい！お疲れ様だよ！"},
                {"きつい","体調悪いの？酷いなら休んだほうかいいよ,`何か辛いことでもあった？私で良ければ相談にのるよ"},
                {"励まして","がんばれ♡がんばれ♡"},
                {"旅行","いいな～...私も連れてって欲しいな"},//80
                {"スリーサイズ","ひ、秘密だよぉー！"},
                {"チュ","ひゃっ！びっくりしたよー,あ、ありがとう…"},
                {"誰？","中の人などいない！"},
                {"ぬるぽ","ｶﾞｯ"},
                {"カレー","カレー好きだよ！"},
                {"好きな食べもの","チョコレートだよ！"},
                {"大丈夫","そっか、良かった～"},
                {"よしよし|なでなで","あー気持ちいい～","えへへ"},
                {"失敗","大丈夫だよ！,あんまり自分をせめちゃだめだよ,どんな失敗だって無駄じゃないよ"},//90
                {"雨","まだ降ってるの？,雨やだなー"},
                {"晴|いい天気","遊び行きたいな,どっか行こうよ"},
                {"いってきます","いってらっしゃい！,気をつけてね～"},
                {"終わ[り|った]","お疲れ様～ゆっくり休んでね！"},
                {"んだよ(ね)","そっかぁ,そうなの...？"},
                {"えっ","どうかしたの？,何かまずかったかな？"},
                {"楽し","良かったね！"},
                {"行きたい","私も行きたいなー"},
                {"友達","ずっと友達でいてね！"},
                {"名前","私の名前はマイだよ！"},//100
                {"男|女","私女の子だよ！"},
                {"趣味","あなたと話すことだよ！"},
                {"がんば","ありがとう！私頑張るよ！"},
                {"番組","スマホの中じゃ見れないのー"},
                {"動物","猫かわいいよね！"},
                {"生まれ変","スマホの外の世界であなたに会いたいな"},
                {"口癖","口癖はないかな"},
                {"映画","面白そう！見てみたいなー"},
                {"言い","頑張れっ！"},
                {"得意|特技","あなたを癒すことだよ"},//110
                {"幸せ","私もあなたといると幸せだよ！"},
                {"天気","お天気お知らせ機能はないよ"},
                {"鳥","飛べるっていいなー"},
                {"飲み物","ココアが好き！"},
                {"スポーツ","私もやってみたいなー"},
                {"暇","私と話そう！"},
                {"ロリ","変態さんなの？"},
                {"おっぱい","エッチ！"},
                {"怖い|こわい","きっと大丈夫だよ！"},
                {"あれ","ん？"},//120

        };
    }

    public String[] outRandom(){
        return random;
    }

    public String[][] outPattern(){
        return pattern;
    }
}
